In [7]:
import pandas as pd

### Appending one dataframe into another dataframe

In [8]:
df1=pd.DataFrame({'Roll':[1,2,3,4],"Marks":[34,34,56,90],'Extra':[45,56,7,90]})
df2=pd.DataFrame({'Roll':[5,6,7,8],"Marks":[44,67,16,96]})

In [9]:
df1

   Roll  Marks  Extra
0     1     34     45
1     2     34     56
2     3     56      7
3     4     90     90

In [10]:
df2

   Roll  Marks
0     5     44
1     6     67
2     7     16
3     8     96

In [11]:
df1.append(df2)

C:\Users\admin\AppData\Local\Temp\ipykernel_12956\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   Roll  Marks  Extra
0     1     34   45.0
1     2     34   56.0
2     3     56    7.0
3     4     90   90.0
0     5     44    NaN
1     6     67    NaN
2     7     16    NaN
3     8     96    NaN

In [12]:
 df1.append(df2,ignore_index=True) #index would be continued

C:\Users\admin\AppData\Local\Temp\ipykernel_12956\4108187587.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2,ignore_index=True) #index would be continued

   Roll  Marks  Extra
0     1     34   45.0
1     2     34   56.0
2     3     56    7.0
3     4     90   90.0
4     5     44    NaN
5     6     67    NaN
6     7     16    NaN
7     8     96    NaN